app/controllers/foods_controller.rb

SELECT  "foods".* FROM "foods"  WHERE (1) LIMIT 1
---
  def show
    #corresponds magically to show.html.erb??
    @food = Food.all #this is what it selects from the database so the html will show